// Note: This contains a very long zero-width-space at the end
// In order to block showing any complex type info
/* eslint-disable no-irregular-whitespace */
type Hider = `Typescript Type System Adventure - by Rick Love 🤓​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​ `;
// type Hider = {};
/* eslint-enable no-irregular-whitespace */

/** ### Typescript Type System Adventure
 * 
 * @author Rick Love
 * @date   2020-10-24
 * @license This work is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International License.
 * 
 * ### Ascii Art
 * 
 * ```text
 *  .......................................................
 *  :                                                     :
 *  : Typescript Type System Adventure                    :
 *  : by: Rick Love                                       :
 *  :                                           _____     :
 *  : _________________________________        |     |    :
 *  : |----|  Typescript        |-----|        |     |    :
 *  : |----|   Type             |-----|        |     |    :
 *  : |----|    System          |-----|        |     |    :
 *  : |----|     Adventure      |-----|        |     |    :
 *  : |----|______by: Rick Love_|-----|        |     |    :
 *  : |-------------------------------|        |     |    :
 *  : |-------------------------------|        |     |    :
 *  : |-------_________________-------|        |     |    :
 *  : |------|            |    |------|      __|     |__  :
 *  : |------|  --        |    |------|       *       *   :
 *  : |------| |  |       |    |------|        *     *    :
 *  : |------| |__|       |    |------|         *   *     :
 *  :  *_____|____________|____|______|          * *      :
 *  :                                             *       :
 *  :.....................................................:
 * ```
 * 
 * ### Summary
 * 
 * So this was written for fun!
 * 
 * ### Note: 
 * 
 * This is a work of fiction. It's not code that you can run or anything. It's a fun toy playing with the typescript type system.
 *
 * Feel free to learn and make your own, but please give me credit for coming up with the idea with this link:
 * https://ricklove.me/typescript-type-system-adventure
 * 
 * ### Inspiration:
 * 
 * Also this was inspired by this amazing SQL typescript type system parser:
 * https://github.com/codemix/ts-sql
 * 
 * ### Sharing
 * 
 * **Please share it with all your nerd friends!**
 * 
 * https://ricklove.me/typescript-type-system-adventure
 */
export type GameStart = Hider & GameStateCommon & { hasGameStarted: false };

type GameStateCommon<TLocation extends string = string, TInventory extends {} = {}, TEnvironment extends {} = {}> = { location: TLocation, inventory: TInventory, environment: TEnvironment };
type SetLocation<T extends GameStateCommon, TNew extends string> = { location: TNew } & Omit<T, 'location'>;
type SetInventory<T extends GameStateCommon, TNew> = { inventory: TNew & Omit<T['inventory'], keyof TNew> } & Omit<T, 'inventory'>;
type SetEnvironment<T extends GameStateCommon, TNew> = { environment: TNew & Omit<T['environment'], keyof TNew> } & Omit<T, 'environment'>;

type UnknownCommand<T> = {
    /** ### Unknown Command
     * 
     * I don't know what you mean. Try Again.
     * 
     */
    execute: T;
};

type Location_InFrontOfHouse = 'In Front of House';

export type Command<TState extends GameStateCommon, TCommand> =
    TCommand extends 'inv' | 'inventory' ? {
        /** ### Inventory
         * 
         * You examine your inventory.
         * 
         * How does all this stuff fit in here anyway?
         * 
         * (🔎 Look at the inventory type at the top ⬆)
         */
        execute: { inventory: TState['inventory'] } & TState;
    }
    : Hider &
    // Game Start
    [TCommand, TState] extends ['begin', { hasGameStarted: false }] ?
    {
        /** ### Begin Your Adventure
         * 
         * You have begun an amazing adventure!
         * 
         * Have fun!
         */
        execute: Hider & { hasGameStarted: true, location: Location_InFrontOfHouse, inventory: {}, environment: {} };
    }

    // In Front of House
    : [TCommand, TState] extends ['look', { location: Location_InFrontOfHouse, environment: { mailbox?: 'closed' } }] ?
    {
        /** ### In Front of House
         * 
         * You are in front of an old house.
         * 
         * There is a mailbox nearby.
         */
        execute: TState;
    }
    : [TCommand, TState] extends ['open mailbox', { location: Location_InFrontOfHouse, environment: { mailbox?: 'closed' } }] ?
    {
        /** ### Open Mailbox 
         * 
         * You open the mainbox and find a letter inside 
         * 
         * The front of the envelope reads: 
         * 
         * 'To: The Finder of This Letter'
         */
        execute: Hider & SetInventory<SetEnvironment<TState, { mailbox: 'open' }>, { envelope: true }>;
    }
    : [TCommand, TState] extends ['look', { location: Location_InFrontOfHouse, environment: { mailbox: 'open' }, inventory: { envelope: true } }] ?
    {
        /** ### In Front of House
         * 
         * You are standing in front of an old house.
         * 
         * You have an envelope in your hand.
         */
        execute: TState;
    }
    : [TCommand, TState] extends ['look', { location: Location_InFrontOfHouse, environment: { mailbox: 'open' }, inventory: { letter: 'read' } }] ?
    {
        /** ### In Front of House
         * 
         * You are in front of an old house.
         * 
         * There is an open mailbox nearby.
         * 
         * You notice a light flickering in the house.
         */
        execute: TState;
    }

    // Envelope
    : [TCommand, TState] extends ['open envelope', { inventory: { envelope: true } }] ?
    {
        /** ### Open Envelope 
         * 
         * You open the envelope and find an single sheet of paper inside.
         * 
         * The paper is very brittle, it must be very old. You've never touched parchment before, but this is probably it. 
         */
        execute: Hider & SetInventory<TState, { letter: true, envelope: false }>;
    }
    // Letter
    : [TCommand, TState] extends ['read letter', { inventory: { letter: true | 'read' } }] ?
    {
        /** ### Read Letter
         * 
         * You read the old letter:
         * 
         * > You are beginning to enter a dangerous realm. 
         * > What you thought you knew previously will soon be a shadow in your dreams.
         * > Find the best way forward and do not listen to the foolish.
         * >
         * > It is not the unknown which you should fear. 
         * >
         * > Beware the any!
         */
        execute: Hider & SetInventory<TState, { letter: 'read' }>;
    }
    // Unknown
    : UnknownCommand<TState>;

// Play Game
type Step00 = GameStart;
type Step01 = Command<Step00, 'begin'>['execute'];
type Step02 = Command<Step01, 'look'>['execute'];
type Step03 = Command<Step02, 'open mailbox'>['execute'];
type Step04 = Command<Step03, 'inventory'>['execute'];
type Step04b = Command<Step04, 'look'>['execute'];
type Step05 = Command<Step04b, 'open envelope'>['execute'];
type Step06 = Command<Step05, 'inventory'>['execute'];
type Step07 = Command<Step06, 'read letter'>['execute'];
type Step07b = Command<Step07, 'look'>['execute'];

// const play = () => {
//     const step00 = null as unknown as GameStart;
//     const step01 = null as unknown as Do<typeof step00, 'look'>['_summary'];
//     const step02 = null as unknown as Do<typeof step01, 'look'>;
// };

// // Play Game (Test)
// const play = () => {

//     gameStart
//         .begin()
//         .do(`look`);

// };
